Repository: TrayDigita/Streak
Catalog: languages/*.po
Languages: id

source: Please Insert %s Name
id: Mohon Masukkan Nama %s

source: Please Insert Valid %s Name
id: Harap Masukkan Nama %s yang Valid

source: Class Name %s exist or not valid for repository.
id: Nama kelas %s tidak ada atau tidak sah pada repositori.

source: %s name could not be empty.
id: Nama %s tidak boleh kosong.

source: Acl directory is not exist.
id: Direktori acl %s tidak ada.

source: Acl could not contain nested class.
id: Acl tidak boleh berisi kelas turunan.

source: File %s already exists.
id: Berkas %s sudah ada.

source: Base class name
id: Nama basis kelas

source: Class name
id: Name kelas

source: ACL Access directory
id: Direktori ACL Access

source: ACL file
id: Berkas ACL

source: Are you sure [Y/n]
id: Apa anda yakin [Y/n]

source: Directory %s is not writable.
id: Direktori %s tidak dapat ditulis.

source: File %s is exists.
id: Berkas %s tidak ada.

source: ACL Identity directory
id: Direktori ACL Identity

source: [%s] Generate %s
id: [%s] Hasilkan %s

source: The %s command generates a blank %s class.
id: Perintah %s menghasilkan kelas kosong %s.

source: Name to use for the %s
id: Nama yang digunakan untuk %s

source: The namespace to use for class name %s
id: Namespace untuk digunakan pada nama kelas %s

source: Namespace `%s` is invalid.
id: Namespace `%s` tidak sah.

source: Please Insert Namespace (Empty To Ignore)
id: Harap Masukkan Namespace (Kosongkan Untuk Abaikan)

source: Please Insert Valid Namespace (Empty To Ignore)
id: Harap Masukkan Namespace Yang Sah (Kosongkan Untuk Abaikan)

source: You must override the %s method in the concrete command class.
id: Anda harus mengganti metode %s di kelas perintah konkret.

source: Enable Debug
id: Aktifkan Debug

source: Parameters value contains invalid key name.
id: Nilai parameter berisi nama kunci yang tidak valid.

source: Parameter %s is not exists.
id: Parameter %s tidak ada.

source: Cannot override frozen service "%s".
id: Tidak dapat mengganti layanan yang dibekukan "%s".

source: Identifier "%s" is not defined.
id: Pengenal "%s" tidak ditentukan.

source: Argument object closure is not allowed.
id: Objek argumen closure tidak diijinkan.

source: Class name %s is not exists.
id: Nama kelas %s tidak ada.

source: Class name %s is not instantiable.
id: Nama kelas %s tidak dapat dipakai.

source: Class name %s contain required parameters (%s).
id: Nama kelas %s berisi parameter yang diperlukan (%s).

source: Class name %s contain required parameter type: (%s) that could not to be resolved.
id: Nama kelas %s berisi jenis parameter yang diperlukan: (%s) yang tidak dapat diselesaikan.

source: Class name %s contain required parameters.
id: Nama kelas %s berisi parameter yang diperlukan.

source: Call to undefined property %s.
id: Panggil ke properti yang tidak ditentukan %s.

source: Dispatching route
id: Mengirim route

source: Can not add %1$s while the %1$s already initiated to processing.
id: Tidak dapat menambahkan %1$s saat %1$s sudah mulai memproses.

source: Controller directory is not exist.
id: Direktori controller tidak ada.

source: Max depth of class name is %d, you have %d depth.
id: Kedalaman maksimum nama kelas adalah %d, Anda memiliki kedalaman %d.

source: Controller directory
id: Direktori controller

source: Controller file
id: Berkas controller

source: Route %s does not have controller.
id: Rute %s tidak memiliki controller.

source: Route controller %s does not have fallback method.
id: Pengontrol rute %s tidak memiliki metode kembalian.

source: Route controller %s does not have fallback method %s.
id: Route controller %s tidak memiliki metode kembalian %s.

source: Route controller method does not returning %s.
id: Route controller method tidak mengembalikan %s.

source: Table for model %s is not exist.
id: Tabel untuk model %s tidak ada.

source: Argument parameters key index must be as a string, %s given.
id: Parameter argumen indeks kunci harus sebagai string, %s diberikan.

source: Table %s does not have primary key
id: Tabel %s tidak memiliki kunci utama

source: Update method does not where statement
id: Metode pembaruan tidak ada pernyataan where

source: Column (%s) must be set.
id: Kolom (%s) harus deklarasikan.

source: Model directory is not exist.
id: Direktori model %s tidak ada.

source: Model directory
id: Direktori model

source: Model file
id: Berkas model

source: Invalid value to be quote, quote value could not be instance of `Closure` or as a `Resource`.
id: Nilai kutipan tidak valid, nilai kutipan tidak boleh berupa instance `Closure` atau sebagai `Resource`.

source: Invalid value to be quote, quote value must be as a string.
id: Nilai tidak valid untuk dijadikan kutipan, nilai kutipan harus berupa string.

source: Invalid statement binding count with sql query : %s.
id: Jumlah pengikatan pernyataan tidak valid dengan kueri sql : %s.

source: Invalid parameter table name. Table name could not be empty.
id: Nama parameter tabel tidak valid. Nama tabel wajib diisi.

source: Invalid table name type. Table name must be as string or array.
id: Jenis nama tabel tidak valid. Nama tabel harus berupa string atau array.

source: Call to undefined Method %s.
id: Memanggil ke Metode yang tidak ditentukan %s.

source: Argument must be subclass of %s, % given.
id: Argument kelas turunan dari %s, diberikan %s.

source: Class name %s is not valid.
id: Nama kelas %s tidak sah.

source: Database type %s is not exist.
id: Jenis basis data %s tidak ada.

source: Columns %s is not exists on index %s column %s
id: Kolom %s tidak ada pada indeks %s kolom %s

source: %s is not exist.
id: %s tidak ada.

source: %s is not a valid file.
id: %s bukan file yang sah.

source: File %s contains empty data.
id: Berkas %s berisi data kosong.

source: Argument is empty data or whitespace only.
id: Argument berupa data kosong atau hanya whitespace.

source: 500 Internal Server Error
id: 500 Kesalahan Internal Server

source: Middleware directory is not exist.
id: Direktori middleware %s tidak ada.

source: Middleware could not contain nested class.
id: Middleware tidak dapat berisi kelas turunan.

source: Middleware directory
id: Direktori middleware

source: Middleware file
id: Berkas middleware

source: Users model has not been fetched yet.
id: Model pengguna belum diambil.

source: module
id: modul

source: Module directory is not exist.
id: Direktori modul %s tidak ada.

source: Module could not contain nested class.
id: Modul tidak boleh berisi kelas turunan.

source: Directory %s already exists.
id: Direktori %s sudah ada.

source: Module name
id: Nama modul

source: Module directory
id: Direktori modul

source: Module file
id: Berkas modul

source: Controller path is not defined.
id: Path controller tidak ditentukan.

source: Controller path %s is not exists.
id: Path controller %s tidak ada.

source: %s does not exists.
id: %s tidak ada.

source: %s is a directory.
id: %s merupakan direktori.

source: %s is not readable.
id: %s tidak dapat dibaca.

source: %s is not php file.
id: %s bukan berkas php.

source: Suffix %s is not match with basename %s.
id: Akhiran %s tidak sesuai dengan nama dasar %s.

source: Could not found object on file %s.
id: Tidak dapat menemukan object pada berkas %s.

source: Could not found class %s on file %s.
id: Tidak meneukan kelas %s pada berkas %s.

source: Class %s is not instance of %s.
id: Kelas %s bukan merupakan instance dari %s.

source: Processing task.
id: Memproses tugas.

source: Task done.
id: Tugas selesai.

source: Task error.
id: Tugas bermasalah.

source: Unknown
id: Tidak diketahui

source: Scheduler directory is not exist.
id: Direktori penjadwal tidak ada.

source: Scheduler could not contain nested class.
id: Penjadwal tidak dapat berisi kelas turunan.

source: Scheduler directory
id: Direktori penjadwal

source: Scheduler file
id: Berkas penjadwal

source: Fill with response result of task of %s
id: Isi dengan hasil respon tugas %s

source: The %s to run the task scheduler
id: %s untuk menjalankan penjadwal tugas

source: [%s] Run the scheduler
id: [%s] Menjalankan penjadwal

source: Database Schema
id: Skema Basis Data

source: Checking database schema
id: Memeriksa skema basis data

source: Creating database tables %s
id: Membuat tabel %s pada basis data

source: Database schema tables for scheduler are complete.
id: Skema tabel basis data untuk penjadwal telah selesai.

source: No schedule to be execute
id: Tidak ada jadwal yang bisa dieksekusi

source: Scheduler
id: Penjadwal

source: Execute %d scheduler on total.
id: Mengeksekusi dengan total %d penjadwal.

source: Pending
id: Tertunda

source: Task must be subclass of %s, %s given.
id: Tugas harus kelas turunan dari %s, diberikan %s.

source: Can not add task, task %s already processed.
id: Tidak dapat menambahakan tugas, tugas %s telah diproses.

source: Can not add task, task %s in progress.
id: Tidak dapat menambah tugas, tugas %s sedang berlangsung.

source: Can not delete task, task %s in progress.
id: Tidak dapat menghapus tugas, tugas %s sedang berlangsung.

source: Session save path %s is not writable.
id: Penyimpanan session %s tidak dapat ditulisi.

source: Method not allowed.
id: Metode tidak diijinkan.

source: Not found.
id: Tidak ditemukan.

source: 404 Not Found
id: 404 Tidak Ditemukan

source: The requested resource could not be found. Please verify the URI and try again.
id: Sumber daya yang diminta tidak dapat ditemukan. Harap verifikasi URI dan coba lagi.

source: 405 Method Not Allowed
id: 405 Metode Tidak Diijinkan

source: The request method is not supported for the requested resource.
id: Metode permintaan tidak didukung untuk sumber daya yang diminta.

source: Bad request.
id: Permintaan buruk.

source: 400 Bad Request
id: 400 Permintaan Buruk

source: The server cannot or will not process the request due to an apparent client error.
id: Server tidak dapat atau tidak akan memproses permintaan dikarenakan kesalahan klien yang nyata.

source: Unauthorized.
id: Tidak sah.

source: 401 Unauthorized
id: 401 Tidak Sah

source: The request requires valid user authentication.
id: Permintaan memerlukan otentikasi pengguna yang valid.

source: Not implemented.
id: Tidak dapat diterapkan.

source: 501 Not Implemented
id: 501 Tidak Dapat Diterapkan

source: The server does not support the functionality required to fulfill the request.
id: Server tidak mendukung fungsionalitas yang diperlukan untuk memenuhi permintaan.

source: Internal server error.
id: Kesalahan internal server.

source: Unexpected condition encountered preventing server from fulfilling request.
id: Terjadi kondisi tak terduga yang mencegah server memenuhi permintaan.

source: Gone.
id: Hilang.

source: 410 Gone
id: 410 Hilang

source: The target resource is no longer available at the origin server.
id: Sumber daya target tidak lagi tersedia di server asal.

source: Forbidden.
id: Terlarang.

source: 403 Forbidden
id: 403 Terlarang

source: You are not permitted to perform the requested operation.
id: Anda tidak diizinkan untuk melakukan operasi yang diminta.

source: Content-Range header is not fulfilled.
id: Header Content-Range tidak terpenuhi.

source: Server only accept bytes unit.
id: Server hanya menerima unit byte.

source: Content-Range start bytes must be zero without Request-Id.
id: Byte awal Content-Range harus nol tanpa Request-Id.

source: Invalid uploaded file name.
id: Nama berkas unggahan tidak valid.

source: Invalid Request-Id header.
id: Request-Id header tidak valid.

source: Range bytes is out of range.
id: Rentang byte berada di luar jangkauan.

source: There was an error with uploaded file.
id: Terdapat kesalahan dengan berkas unggahan.

source: Range size is bigger than file size.
id: Ukuran rentang lebih besar dari ukuran berkas.

source: Uploaded file size is bigger than ending size.
id: Ukuran berkas unggahan lebih besar dari ukuran akhir.

source: Could not save uploaded file.
id: Tidak dapat menyimpan berkas unggahan.

source: Cache upload storage does not exist.
id: Penyimpanan cache unggahan tidak ada.

source: Cache upload storage is not writable.
id: Penyimpanan cache unggahan tidak dapat ditulisi.

source: Upload cache file is not writable.
id: Cache unggahan tidak dapat ditulisi.

source: Can not create cached stream.
id: Tidak dapat membuat stream cache.

source: Cache file has been locked.
id: Berkas cache telah dikunci.

source: Offset upload position is invalid.
id: Offset posisi unggahan tidak valid.

source: Source uploaded file does not exist.
id: Sumber berkas unggahan tidak ada.

source: Upload cache file is not ready to move : (%d).
id: Berkas cache unggahan belum siap untuk dipindah: (%d).

source: Could not determine increment target file.
id: Tidak dapat menentukan urutan berkas tujuan.

source: %s is not writable.
id: %s tidak dapat ditulisi.

source: Type
id: Jenis

source: Code
id: Kode

source: Message
id: Pesan

source: File
id: Berkas

source: Line
id: Baris

source: Trace
id: Rekam Jejak
